2D/exp8/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint;

setFormat       raw;

sets
(

    data2
    {
        type    uniform;
        axis    y;
        start   (0.18 0 0.05);
        end     (0.18 0.12 0.05);
        nPoints 600;
    }

    data3
    {
        type    uniform;
        axis    y;
        start   (0.3 0 0.05);
        end     (0.3 0.111 0.05);
        nPoints 600;
    }

    data4
    {
        type    uniform;
        axis    y;
        start   (0.48 0 0.05);
        end     (0.48 0.1297 0.05);
        nPoints 600;
    }

    data5
    {
        type    uniform;
        axis    y;
        start   (0.54 0 0.05);
        end     (0.54 0.1515 0.05);
        nPoints 600;
    }

    data6
    {
        type    uniform;
        axis    y;
        start   (0.66 0 0.05);
        end     (0.66 0.1676 0.05);
        nPoints 600;
    }

    data7
    {
        type    uniform;
        axis    y;
        start   (0.78 0 0.05);
        end     (0.78 0.1809 0.05);
        nPoints 600;
    }

    data8
    {
        type    uniform;
        axis    y;
        start   (0.90 0 0.05);
        end     (0.90 0.1919 0.05);
        nPoints 600;
    }

    data9
    {
        type    uniform;
        axis    y;
        start   (1.02 0 0.05);
        end     (1.02 0.20 0.05);
        nPoints 600;
    }

    data10
    {
        type    uniform;
        axis    y;
        start   (1.14 0 0.05);
        end     (1.14 0.2031 0.05);
        nPoints 600;
    }

    data11
    {
        type    uniform;
        axis    y;
        start   (1.26 0 0.05);
        end     (1.26 0.2031 0.05);
        nPoints 600;
    }

    data12
    {
        type    uniform;
        axis    y;
        start   (1.38 0 0.05);
        end     (1.38 0.2045 0.05);
        nPoints 600;
    }

    data13
    {
        type    uniform;
        axis    y;
        start   (1.59 0 0.05);
        end     (1.59 0.2045 0.05);
        nPoints 600;
    }
);


fields          (Ux);

// ************************************************************************* //
